package com.ourgame.mahjong.table.controller
{
	import com.ourgame.mahjong.Main;
	import com.ourgame.mahjong.table.method.TableMethod;
	import com.wecoit.mvc.Controller;
	import com.wecoit.mvc.State;
	import com.wecoit.mvc.core.INotice;
	
	/**
	 * 桌子控制器
	 * @author SiaoLeon
	 */
	public class TableController extends Controller
	{
		// -------------------------------------------------------------------------------------------------------- 静态常量
		
		// -------------------------------------------------------------------------------------------------------- 静态变量
		
		// -------------------------------------------------------------------------------------------------------- 静态方法
		
		// -------------------------------------------------------------------------------------------------------- 静态函数
		
		// -------------------------------------------------------------------------------------------------------- 属性
		
		// -------------------------------------------------------------------------------------------------------- 变量
		
		// -------------------------------------------------------------------------------------------------------- 构造
		
		/**
		 * 构造函数
		 */
		public function TableController()
		{
			super();
		}
		
		// -------------------------------------------------------------------------------------------------------- 方法
		
		override public function onAdd():void
		{
			this.register(TableMethod.GAME_INVITE, GAME_INVITE);
		}
		
		// -------------------------------------------------------------------------------------------------------- 函数
		
		private function GAME_INVITE(notice:INotice):void
		{
			((this.context as State).manager as Main).info.data.gameProxy.start();
		}
	
	}
}
